GDP 데이터를 이용해 아래 문젱에 해당하는 데이터만 추출
0. Ranking 컬럼 추가
1. 상위 5개국의 국가 코드명과 랭킹 컬럼
2. 중국, 일본, 한국의 랭킹과 GDP 컬럼
3. 랭킹이 홀수인 국가들의 코드, 랭킹, GDP 컬럼
4. 랭킹이 짝수이면서 10위 이하 국가들의 코드, 랭킹, GDP 컬럼

gdp2018.csv

In [1]:
import pandas as pd

In [2]:
dataList = []
dl = dataList

In [3]:
dl.append(pd.read_csv('c:/data/gdp2018.csv'))
dl[0].head(3)

  Code          Nation       GDP
0  GBR  United Kingdom   3074432
1  JPN           Japan   5484951
2  IND           India  10498468

In [4]:
dl.append(dl[0].sort_values('GDP', ascending=False))
dl[1].head(3)

   Code         Nation       GDP
15  CHN          China  25361744
3   USA  United States  20494100
2   IND          India  10498468

In [5]:
dl[1]["Rangking"] = range(1 ,len(dl[1]) + 1)
dl[1].head(3)

   Code         Nation       GDP  Rangking
15  CHN          China  25361744         1
3   USA  United States  20494100         2
2   IND          India  10498468         3

In [6]:
dl.append(dl[1][dl[1]['Nation'].isin(['Korea Rep.','Japan','China'])])
dl[2][['Nation','Rangking','GDP']]

        Nation  Rangking       GDP
15       China         1  25361744
1        Japan         4   5484951
5   Korea Rep.        14   2090161

In [7]:
dl.append(dl[1][::2])
dl[3][['Code','Rangking','GDP']].head(3)

   Code  Rangking       GDP
15  CHN         1  25361744
2   IND         3  10498468
10  DEU         5   4505236

In [8]:
dl.append(dl[1][1:10:2])
dl[4][['Code','Rangking','GDP']]

   Code  Rangking       GDP
3   USA         2  20494100
1   JPN         4   5484951
4   RUS         6   3986064
18  BRA         8   3365757
6   FRA        10   3073179

도형 프린트

In [9]:
for i in range(5):
    print('*' * (i + 1))

*
**
***
****
*****

In [15]:
for i in range(5):
    print("{:>5}".format('*' * (i + 1)))

    *
   **
  ***
 ****
*****

In [23]:
for i in range(5,0,-1):
    print("{:>5}{}".format('1' * i, '2' * (i - 1)))

111112222
 1111222
  11122
   112
    1

In [20]:
for i in range(5):
    print("{:>5}{}".format('1' * (i + 1), '2' * i))
for i in range(4,0,-1):
    print("{:>5}{}".format('3' * (i), '4' * (i - 1)))

    1
   112
  11122
 1111222
111112222
 3333444
  33344
   334
    3